<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"sandbox","backend":"2700e07bd1d32a631cce461065fa9c337fc05fcf831fa9c36677dd111084218b","plan_job_ref":"Job .github/workflows/_test-tf.yaml #29 at https://github.com/DND-IT/github-workflows/actions/runs/14660005237","plan_out_hash":"916dbda72c3c585aedf8a511577a3bce6211c32f43c563bcd0b8ce923ec85b3c","plan_hash":"932b0b318560fcd54f969ea66b49661bc81dba1536bfa1f0df45498125c5bba5","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan for __sandbox__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)

Warning: Missing resource schema from provider

No resource schema found for aws_ecr_lifecycle_policy when decoding prior
state

Warning: Missing resource schema from provider

No resource schema found for aws_ecr_repository when decoding prior state

Warning: Missing resource schema from provider

No resource schema found for aws_ecr_repository_policy when decoding prior
state
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #29](https://github.com/DND-IT/github-workflows/actions/runs/14660005237)